<a href="https://colab.research.google.com/github/tekmologi8/Data-Analytics/blob/main/Pandas_iloc()_and_loc().ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**loc()** : loc() is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc() . Many operations can be performed using the loc() method like.

In [1]:
# importing the module
import pandas as pd
   
# creating a sample dataframe
data = pd.DataFrame({'Brand' : ['Mercedes', 'Hyundai', 'Tata',
                                'Kia', 'Mazda', 'Hyundai',
                                'Renault', 'ProBox', 'Mercedes'],
                     'Year' : [2012, 2014, 2011, 2015, 2012, 
                               2016, 2014, 2018, 2019],
                     'Kms/Driven' : [50000, 30000, 60000, 
                                     25000, 10000, 46000, 
                                     31000, 15000, 12000],
                     'City' : ['Kampala', 'Nairobi', 'Mombasa', 
                               'Dodoma', 'Mumias', 'Dodoma', 
                               'Mombasa','Chemelil',  'Garissa'],
                     'Mileage' :  [28, 27, 25, 26, 28, 
                                   29, 24, 21, 24]})
   
# displaying the DataFrame
display(data)

      Brand  Year  Kms/Driven      City  Mileage
0  Mercedes  2012       50000   Kampala       28
1   Hyundai  2014       30000   Nairobi       27
2      Tata  2011       60000   Mombasa       25
3       Kia  2015       25000    Dodoma       26
4     Mazda  2012       10000    Mumias       28
5   Hyundai  2016       46000    Dodoma       29
6   Renault  2014       31000   Mombasa       24
7    ProBox  2018       15000  Chemelil       21
8  Mercedes  2019       12000   Garissa       24

In [8]:
# Selecting data according to some conditions :
# selecting cars with brand 'Mercedes' and Mileage > 25
display(data.loc[(data.Brand == 'Mercedes') & (data.Mileage > 25)])

      Brand  Year  Kms/Driven     City  Mileage
0  Mercedes  2012       50000  Kampala       28

In [10]:
# Selecting a range of rows from the DataFrame :
# selecting range of rows from 2 to 5
display(data.loc[2 : 5])

     Brand  Year  Kms/Driven     City  Mileage
2     Tata  2011       60000  Mombasa       25
3      Kia  2015       25000   Dodoma       26
4    Mazda  2012       10000   Mumias       28
5  Hyundai  2016       46000   Dodoma       29

In [2]:
#Updating the value of any column
# updating values of Mileage if Year < 2015
data.loc[(data.Year < 2015), ['Mileage']] = 22
display(data)

      Brand  Year  Kms/Driven      City  Mileage
0  Mercedes  2012       50000   Kampala       22
1   Hyundai  2014       30000   Nairobi       22
2      Tata  2011       60000   Mombasa       22
3       Kia  2015       25000    Dodoma       26
4     Mazda  2012       10000    Mumias       22
5   Hyundai  2016       46000    Dodoma       29
6   Renault  2014       31000   Mombasa       22
7    ProBox  2018       15000  Chemelil       21
8  Mercedes  2019       12000   Garissa       24

iloc() : iloc() is a indexed based selecting method which means that we have to pass integer index in the method to select specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc(). Operations performed using iloc() are:

In [3]:
#Selecting rows using integer indices:

# selecting 0th, 2th, 4th, and 7th index rows
display(data.iloc[[0, 2, 4, 7]])

      Brand  Year  Kms/Driven      City  Mileage
0  Mercedes  2012       50000   Kampala       22
2      Tata  2011       60000   Mombasa       22
4     Mazda  2012       10000    Mumias       22
7    ProBox  2018       15000  Chemelil       21

In [4]:
#Selecting a range of columns and rows simultaneously:

# selecting rows from 1 to 4 and columns from 2 to 4
display(data.iloc[1 : 5, 2 : 5])

   Kms/Driven     City  Mileage
1       30000  Nairobi       22
2       60000  Mombasa       22
3       25000   Dodoma       26
4       10000   Mumias       22